JayHeng/RT-SNAND/boards/mcu/snand_fw/imxrt595/port_mixspi_info.h
        const uint32_t port1_pin28_config = (/* Pin is configured as FLEXSPI0_DQS */
                                             IOPCTL_PIO_FUNC1 |
                                             /* Enable pull-up / pull-down function */
                                             IOPCTL_PIO_PUPD_EN |
                                             /* Enable pull-down function */
                                             IOPCTL_PIO_PULLDOWN_EN |
                                             /* Enables input buffer function */
                                             IOPCTL_PIO_INBUF_EN |
                                             /* Normal mode */
                                             IOPCTL_PIO_SLEW_RATE_NORMAL |
                                             /* Full drive enable */
                                             IOPCTL_PIO_FULLDRIVE_EN |
                                             /* Analog mux is disabled */
                                             IOPCTL_PIO_ANAMUX_DI |
                                             /* Pseudo Output Drain is disabled */
                                             IOPCTL_PIO_PSEDRAIN_DI |
                                             /* Input function is not inverted */
                                             IOPCTL_PIO_INV_DI);
        /* PORT1 PIN28 (coords: U14) is configured as FLEXSPI0_DQS */
        IOPCTL_PinMuxSet(IOPCTL, 1U, 28U, port1_pin28_config);
    }
    else if (base == FLEXSPI1)
    {
        
    }
    else
    {
    }
}

//!@brief Gate on the clock for the FlexSPI peripheral
static void mixspi_clock_gate_enable(FLEXSPI_Type *base)
{
    if (base == FLEXSPI0)
    {
        RESET_PeripheralReset(kFLEXSPI0_RST_SHIFT_RSTn);
        CLOCK_EnableClock(kCLOCK_Flexspi0);
    }
    else if (base == FLEXSPI1)
    {
        RESET_PeripheralReset(kFLEXSPI1_RST_SHIFT_RSTn);
        CLOCK_EnableClock(kCLOCK_Flexspi1);
    }
}

//!@brief Gate off the clock the FlexSPI peripheral
static void mixspi_clock_gate_disable(FLEXSPI_Type *base)
{
    if (base == FLEXSPI0)
    {
        CLOCK_DisableClock(kCLOCK_Flexspi0);
    }
    else if (base == FLEXSPI1)
    {
        CLOCK_DisableClock(kCLOCK_Flexspi1);
    }
}

static void mixspi_clock_init(FLEXSPI_Type *base, mixspi_root_clk_freq_t clkFreq)
{
    if (base == FLEXSPI0)
    {
        if (clkFreq == kMixspiRootClkFreq_30MHz)
        {
            /* Move FLEXSPI clock source from main clock to FRO192M / 7 to avoid instruction/data fetch issue in XIP when
             * updating PLL and main clock.
             */
            BOARD_SetFlexspiClock(EXAMPLE_MIXSPI, 3U, 7U);
        }
        else if (clkFreq == kMixspiRootClkFreq_50MHz)
        {
            /* Set FlexSPI clock: source AUX0_PLL£¨396MHz£©, divide by 8 */
            BOARD_SetFlexspiClock(EXAMPLE_MIXSPI, 2U, 8U);
        }
        else if (clkFreq == kMixspiRootClkFreq_60MHz)
        {
            /* Set FlexSPI clock: source AUX0_PLL£¨396MHz£©, divide by 7 */
            BOARD_SetFlexspiClock(EXAMPLE_MIXSPI, 2U, 7U);
        }
        else if (clkFreq == kMixspiRootClkFreq_80MHz)
        {
            /* Set FlexSPI clock: source AUX0_PLL£¨396MHz£©, divide by 5 */
            BOARD_SetFlexspiClock(EXAMPLE_MIXSPI, 2U, 5U);
        }
        else if (clkFreq == kMixspiRootClkFreq_100MHz)
        {
            /* Set FlexSPI clock: source AUX0_PLL£¨396MHz£©, divide by 4 */
            BOARD_SetFlexspiClock(EXAMPLE_MIXSPI, 2U, 4U);
        }
        else if (clkFreq == kMixspiRootClkFreq_120MHz)
        {
            /* Set FlexSPI clock: source AUX1_PLL£¨327MHz£©, divide by 3 */
            BOARD_SetFlexspiClock(EXAMPLE_MIXSPI, 4U, 3U);
        }
        else if (clkFreq == kMixspiRootClkFreq_133MHz)
        {
            /* Set FlexSPI clock: source AUX0_PLL£¨396MHz£©, divide by 3 */
            BOARD_SetFlexspiClock(EXAMPLE_MIXSPI, 2U, 3U);
        }
        else if (clkFreq == kMixspiRootClkFreq_166MHz)
        {
            /* Set FlexSPI clock: source AUX1_PLL£¨327MHz£©, divide by 2 */
            BOARD_SetFlexspiClock(EXAMPLE_MIXSPI, 4U, 2U);
        }
        else if (clkFreq == kMixspiRootClkFreq_200MHz)
        {
            /* Set FlexSPI clock: source AUX0_PLL£¨396MHz£©, divide by 2 */
            BOARD_SetFlexspiClock(EXAMPLE_MIXSPI, 2U, 2U);
        }
        else if (clkFreq == kMixspiRootClkFreq_332MHz)
        {
            /* Set FlexSPI clock: source AUX1_PLL£¨327MHz£©, divide by 1 */
            BOARD_SetFlexspiClock(EXAMPLE_MIXSPI, 4U, 1U);
        }
        else if (clkFreq == kMixspiRootClkFreq_400MHz)
        {
            /* Set FlexSPI clock: source AUX0_PLL£¨396MHz£©, divide by 1 */
            BOARD_SetFlexspiClock(EXAMPLE_MIXSPI, 2U, 1U);
        }
        else
        {
            snand_printf("SNAND: This FlexSPI clock freq is not set.\r\n");
        }
    }
    else if (base == FLEXSPI1)
    {
    }
    else
    {
    }
}

static uint32_t mixspi_get_clock(FLEXSPI_Type *base)
{
    if (base == FLEXSPI0)
    {
        return CLOCK_GetFlexspiClkFreq(0);
    }
    else if (base == FLEXSPI1)
    {
        return CLOCK_GetFlexspiClkFreq(1);
    }
    else
    {
        return 0;
    }
}

static void mixspi_show_clock_source(FLEXSPI_Type *base)
{
#if SNAND_DEBUG_LOG_INFO_ENABLE
    uint32_t index = 0;
    uint32_t clkSel;
    uint32_t clkDiv;
    if (base == FLEXSPI0)
    {
        index = 0;
        clkSel = CLKCTL0->FLEXSPI0FCLKSEL & CLKCTL0_FLEXSPI0FCLKSEL_SEL_MASK;
        clkDiv = CLKCTL0->FLEXSPI0FCLKDIV & CLKCTL0_FLEXSPI0FCLKDIV_DIV_MASK;
        switch (clkSel)
        {
            case CLKCTL0_FLEXSPI0FCLKSEL_SEL(0):
                snand_printf("SNAND: FLEXSPI0 Clk Source from 3'b000 - Main Clock %dHz.\r\n", CLOCK_GetMainClkFreq());
                break;

            case CLKCTL0_FLEXSPI0FCLKSEL_SEL(1):
               {
                   uint32_t MainPllClkFreq = CLOCK_GetSysPfdFreq(kCLOCK_Pfd0) / ((CLKCTL0->MAINPLLCLKDIV & CLKCTL0_MAINPLLCLKDIV_DIV_MASK) + 1U);
                   snand_printf("SNAND: FLEXSPI0 Clk Source from 3'b001 - Main System PLL Clock %dHz.\r\n", MainPllClkFreq);
                   break;
               }

            case CLKCTL0_FLEXSPI0FCLKSEL_SEL(2):
               {
                   uint32_t Aux0PllClkFreq = CLOCK_GetSysPfdFreq(kCLOCK_Pfd2) / ((CLKCTL0->AUX0PLLCLKDIV & CLKCTL0_AUX0PLLCLKDIV_DIV_MASK) + 1U);
                   snand_printf("SNAND: FLEXSPI0 Clk Source from 3'b010 - SYSPLL0 AUX0 PLL Clock %dHz.\r\n", Aux0PllClkFreq);
                   break;
               }

